from lab_rk2.classes import Book, Library, BookandLibrary

def get_books():
    return [
        Book(1, "Краткая история времени", "Стивен Хокинг", "Научно-популярная литература", 256, "АСТ"),
        Book(2, "Эгоистичный ген", "Ричард Докинз", "Научно-популярная литература", 384, "Эксмо"),
        Book(3, "Думай медленно... решай быстро", "Даниел Канеман", "Научная литература", 512, "Манн, Иванов и Фербер"),
        Book(4, "Современные методы анализа данных", "Татьяна Лебедева", "Специализированная литература", 320, "Наука"),
        Book(5, "Экономика России: вызовы и перспективы", "Алексей Кудрин", " Специализированная литература", 480, "Иностранная литература"),
        Book(6, "Психология и педагогика: теория и практика", "Р. С. Трояновский", "Педагогическая литература", 220, "Просвещение"),
        Book(7, "Математическая логика", "Алексей Смирнин", "Научная литература", 300, "Просвещение"),
        Book(8, "Психология личности", "Елена Иванова", "Психологическая литература", 280, "Эксмо")
    ]

def get_libraries():
    return [
        Library(1, "Центральная городская публичная библиотека имени В. В. Маяковского", "Санкт-Петербург, ул. Маяковского, 1", "Публичная", "5 читальных залов","+7 (812) 123-45-67", "info@mayakovka.ru"),
        Library(2, "Библиотека имени А.С. Пушкина", "Москва, ул. Пушкина, 10", "Университетская", "3 читальных зала", "+7 (495) 987-65-43", "library@pushkin.edu"),
        Library(3, "Школьная библиотека № 45", "Екатеринбург, ул. Ленина, 20", "Школьная", "1 читальный зал", "+7 (343) 123-45-67", "school45@edu.ru"),
        Library(4, "Научная библиотека РАН", "Москва, ул. Академика Сахарова, 15", "Специализированная", "4 читальных зала", "+7 (495) 765-43-21", "info@ranlibrary.ru"),
        Library(5, "Российская государственная библиотека", "Москва, ул. Воздвиженка, 3", "Государственная", "10 читальных залов", "+7 (495) 620-78-00", "info@rsl.ru"),
    ]

def get_books_and_libraries_data():
    return [
        BookandLibrary(1, 1),
        BookandLibrary(1, 4),
        BookandLibrary(1, 5),
        BookandLibrary(2, 4),
        BookandLibrary(2, 5),
        BookandLibrary(3, 4),
        BookandLibrary(4, 5),
        BookandLibrary(5, 5),
        BookandLibrary(5, 4),
        BookandLibrary(6, 3),
        BookandLibrary(7, 3),
        BookandLibrary(7, 4),
        BookandLibrary(7, 5),
        BookandLibrary(8, 4),
        BookandLibrary(8, 5),
    ]